sirfonzie/esp32c3-mtk3/examples/pingpong_c3/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_LWIP_ENABLE=y
CONFIG_BT_ENABLED=n
# WPA3/SAE disabled — avoids crypto timing issues under MTK3 freertos_shim
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=n
CONFIG_ESP_WIFI_ENABLE_WPA3_OWE_STA=n

# The port cannot arm the Task-WDT: IDF initializes it in
# esp_startup_start_app() (wrapped away) and feeds it from the FreeRTOS idle
# task (which does not exist here).  State that honestly instead of building
# with a watchdog config that is silently inert.  The INT-WDT *is* armed and
# fed by the kernel (see kernel/sysdepend/.../interrupt.c).
CONFIG_ESP_TASK_WDT_EN=n
